[
  {
    "title": "The Stages Of Getting Over Mr. Wrong",
    "content": "When we experience the loss of someone we love, our bodies go into panic, and it can feel like the death of a loved one. Meditation can help you separate from the story that feels very factual, and eventually give you the wiggle room to loosen the grip of how you think things should be, in order for you to feel better.<br> Author and spiritual teacher, Byron Katie, reminds us that <strong>when we argue with reality, we suffer … but only 100% of the time</strong>.<br> When we deny, bargain, or indulge anger and sadness over what is, we only create more suffering for ourselves. That said, it’s important to allow our hearts, minds, and bodies to do what they want to do in the initial shock of it all.<br> Allow yourself to move through the five stages of grief as they arise. And don’t think that if you make it to a moment of acceptance but then find yourself depressed again that you’re regressing. It’s perfectly normal for your head and heart to bounce around from stage to stage.<br> Let that pocket of acceptance be a reminder that you will eventually arrive in full acceptance—just keep committing to mindfully showing up and lovingly pooshing yourself forward, over and over again.”",
    "categories": [
      "RELATIONSHIPS",
      " HEALTH",
      " WELLNESS"
    ],
    "date": "February 14, 2022"
  },
  {
    "title": "Hacks To Get You Out Of A Funk",
    "content": "When the days get shorter, a 1 p.m. sun can start drawing long shadows that give more of a 4 or even 5 p.m. vibe. That’s if the sun comes out at all. Ah yes, sweater weather, but also cuffing season, a period of cold fronts, and the time of year that really dials down the fun for those who suffer from Seasonal Affective Disorder, aka S.A.D.<br> S.A.D. is more than just feeling a little blue. It can affect energy levels and motivation and leave us feeling downright depleted. So when you’re in a funk like this, how do you pull yourself out? We’ve compiled a few tips and hacks that can get you into a more elevated mindset, so you can get on with your life.<br> 1. <strong>Circadian regulation</strong>: If lack of sunlight is disrupting your sleep patterns, a sunrise-mimicking alarm clock is perfect to get you back into a circadian cycle. Plus, the low, warm glow and gentle sound options like birds chirping are so much more pleasant on the nervous system in the morning than a jarring alarm.<br> 2. <strong>Get Moving</strong>: While it may be difficult to get inspired, moving your body is an excellent way to move energy around and change your state of being. It could be a brisk walk, a HIIT workout, yoga, jumping up and down and shaking out the limbs, or even just dancing with your headphones on to boost your circulation and give your brain a dopamine hit.<br> 3. <strong>Liposomal Vitamin D</strong>: When it’s chilly out—whether the sun is shining or not—we aren’t getting adequate Vitamin D absorbed through our skin. We’re covered up, and during the winter months the sunlight is at a lower angle and lacks intensity. Vitamin D is crucial for boosting mood, so it’s a smart idea to supplement with a quality vitamin D supplement to prevent a deficiency.<br> 4. <strong>Make some dietary changes</strong>: Dark, leafy greens and fatty fish contain compounds like magnesium and omega-3s that combat depression and lift the spirits. Consider eating more of them whenever possible to keep your brain healthy and high-functioning.<br> 5. <strong>Try a therapeutic light</strong>: Infrared rays are actually visible at sunrise and help wake us up, reset our circadian clocks, boost mood and cognition, and essentially recharge our batteries. Try some rest time under an infrared light to charge up your cells and improve your mood. It’s crazy how our bodies actually absorb and utilize this light—it’s been shown to be just as effective as bright white light. Plus, there are beauty benefits to boot.<br> 6. <strong>Take a bath with a “cold out”</strong>: Another way to get a little mood boost is to take a hot bath followed by a quick (at least 30 seconds) cold rinse after. The shock of cold water immediately kicks circulation and lymphatic drainage into high gear, which creates a rush of energy and a serious pep in your step. Bonus points if you take a magnesium bath for even more mood benefits.",
    "categories": [
      "HEALTH",
      " MIND",
      " WELL-BEING"
    ],
    "date": "March 25, 2022"
  },
  {
    "title": "Odd Food Pairings That Weirdly Work",
    "content": "Chances are we’ve all either been shocked by someone’s strange eating habits or we’ve been the one doing the shocking. But unlike the half-bottle of ketchup + pancakes that we witnessed a Bumble date eat for dinner (don’t ask), there are combos out there that taste amazing even though they sound … pretty strange. We rounded up the ones we love below. Who knows, maybe one of the unusual food pairings below will become a new favorite snack.<hr> <strong>Pickles + Tangerines</strong><br> In a game of Truth or Dare with Sam, Eliza revealed her favorite weird food combo: “I eat pickles with tangerines, combined into a bite.” This random combo has become a running joke in the Poosh group thread, and Eliza sends us a pic every time she has it.<hr> <strong>PB Toast + Eggs</strong><br> “Toast with peanut butter on top, and then eggs—like scrambled eggs,” Sam offered up as her favorite odd combo in that same Truth or Dare sesh. Peep the recipe here, and note that subbing in hard-boiled eggs is a hack for those of us who lack the time/motivation to cook.<hr> <strong>Hawaii Hurricane Popcorn</strong><br> Our wellness editor was introduced to this popcorn by her bf, who grew up in Hawaii, where this unexpected snack hails from. It’s buttery, salty popcorn mixed with crunchy mochi rice crackers and furikake nori seasoning, and it’s surprisingly addictive.<hr> <strong>Jam + Scrambled Eggs</strong><br> Apparently, scrambled eggs taste good with just about anything. This savory/sweet combo works well on its own or atop a piece of toast.<hr> <strong>Berries + Balsamic Vinegar + Burrata Cheese + Fresh Basil</strong><br> Another savory/sweet combo to try, especially during the summer. Not a fan of burrata? Mozzarella, goat cheese, and ricotta are delicious substitutes.",
    "categories": [
      "HOME",
      " ENTERTAINING",
      " RECIPE"
    ],
    "date": "June 17, 2022"
  },
  {
    "title": "How To Prioritize Work-Life Balance",
    "content": "Finding the right work-life balance is way easier said than done, especially given the majority of us are still working from home, whether that is part of the week, or all week long. Before we get into ways to set boundaries and limitations, it’s worth noting that just like when we were all going into the office, some workdays will be longer than others, and that’s completely OK as long as extended hours don’t become a habit. The most important thing is finding what works for your role and lifestyle and that you fully shut off once you “clock out” for the day.<br> Ahead, we’re sharing ways to help make sure you’re sticking to standard office hours and hopefully separating work and “me” time as best as you can.<br> <strong>Avoid looking at emails right when you wake up.</strong><br> As easy as it is to roll over and immediately start cranking out emails or responding to team text messages from the comfort of your bed, it’s a slippery slope and a terribly unhealthy habit. Our editor, Michelle Scanga, admits she’s definitely guilty of this from time to time. “I try my best to enjoy time to myself in the morning, whether it’s a quick call to a family member or aimlessly scrolling on Instagram while I’m still waking up. Since I live with a roommate, I do have to work from my room during some parts of the day when we both have calls, so I make sure to carve out time in the morning to make a matcha latte and separate everyday life and work before I dive into emails.”<br> <strong>Change out of your pajamas.</strong><br> Sounds like a no-brainer, but sometimes 12 o’clock rolls around and, wait, you’re still in your nighty. Not only will you look more presentable on your Zoom meeting, but you’ll also feel better as well. There’s no need to go full blazer and pantsuit, but at least throw on a crisp tee or cozy sweater. The outfit change also breaks up the day so when it’s 6:30 (or whenever your workday ends), you can hop back into your jammies and enjoy your evening.<br> <strong>Schedule breaks for yourself during the day.</strong><br> “For me, it’s always important to schedule in 30-60 minutes a day, no matter how busy I am, to do something for myself, whether that’s a break to step outside, call a family member or friend, etc. Even if I have to split up that time in intervals, it’s important to keep me sane,” Robert Vasquez, from our team, shares.<br> <strong>Make a daily to-do list and stick to it.</strong><br> Oh, the power of prioritizing your tasks. Jonathan Homan, another Poosh team member, gifts us with this token advice: “I have always been a fan of to-do lists and create a new one each and every day. By doing so, I can break down what needs to get done into four categories (urgent and important, important but not urgent, urgent but not important, neither urgent nor important). I also am very mindful of knowing my peaks, so I schedule the tasks that need the most concentration for earlier in the day.”<br> <strong>Have something to look forward to each night.</strong><br> Sam Hyatt, Kourt’s good friend from high school (and Poosh colleague), shoots it straight for us: “The days are nutty, and every single minute is allocated to some sort of task or responsibility. At night, I can’t wait to unwind with my husband after the kids are asleep, and usually, I take an edible or smoke a j (hehe, just being honest), which always helps to minimize my stress, clear my mind, and lull me to sleep.” Whatever evening activity does it for you—could be rewatching your favorite show, cooking a delicious dinner, or a mindless FaceTime session with a friend—be sure to close your laptop and make time for what makes you happy and fulfills you at the end of the day.",
    "categories": [
      "LIFE",
      " STYLE",
      " ADULTING"
    ],
    "date": "August 24, 2022"
  }
]